Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: It translates the ASCII encoded string ascii_str to its equivalent EBCDIC representation (binary safe), and returns the result.
pt_br: Ela converte a string codificada em ASCII ascii_str em sua representação equivalente em EBCDIC (binary safe), retornando o resultado.

source: See also the reverse function ebcdic2ascii()
pt_br: Veja também a função inversa ebcdic2ascii()

source: See also asin(), acosh() and atanh().
pt_br: Veja também asin(), acosh() e atanh().

source: Returns the arc sine of arg in radians. asin() is the complementary function of sin(), which means that a==sin(asin(a)) for every value of a that is within asin() 's range.
pt_br: Retorna o inverso do seno de arg em radianos. asin() é a função complementar de sin(), o que significa que a==sin(asin(a)) para qualquer valor de var que esteja dentro dos limites de asin().

source: See also asinh(), acos() and atan().
pt_br: Veja também asinh(), acos() e atan().

source: Example 1. asort() example
pt_br: Exemplo de asort()

source: $fruits = array ("d"= "lemon", "a"= "orange", "b"= "banana", "c"= "apple"); asort ($fruits); reset ($fruits); while (list ($key, $val) = each ($fruits)) {echo "$key = $val\n";}
pt_br: $frutas = array ("d "= "limao", "a" = "laranja", "b "= "banana", "c" = "melancia"); asort ($frutas); reset ($frutas); while (list ($chave, $valor) = each ($frutas)) {echo "$chave = $valor\n";}

source: c = apple b = banana d = lemon a = orange
pt_br: b = banana a = laranja d = limao c = melancia

source: The fruits have been sorted in alphabetical order, and the index associated with each element has been maintained.
pt_br: As frutas foram ordenadas na ordem alfabética, e os índices associados a cada valor foram mantidos.

source: See also arsort(), rsort(), ksort(), and sort().
pt_br: veja também arsort(), rsort(), ksort() e sort().

source: Example 1. aspell_check()
pt_br: Exemplo 1. aspell_check()

source: Example 1. aspell_check_raw()
pt_br: Exemplo 1. aspell_check_raw()

source: Example 1. aspell_new()
pt_br: Exemplo 1. aspell_new()

source: Example 1. aspell_suggest()
pt_br: Exemplo 1. aspell_suggest()

source: BCMath Arbitrary Precision Mathematics Functions
pt_br: BCMath Funções Matemáticas de Precisão Arbitrária

source: This function calculates the arc tangent of the two variables x and y.
pt_br: Esta função calcula a tangente inversa de duas variaveis x e y.

source: It is similar to calculating the arc tangent of y / x, except that the signs of both arguments are used to determine the quadrant of the result.
pt_br: Esta função é o equivalente a calcular a tangente inversa de y / x, exceto que os sinais de ambos os argumentos são usados para determinar o quadrante do resultado.

source: The function returns the result in radians, which is between -PI and PI (inclusive).
pt_br: Esta função retorna o resultado em radianos, estando entre -PI e PI (inclusive).

source: See also acos() and atan().
pt_br: Veja também acos() e atan().

source: See also atan(), asinh() and acosh().
pt_br: Veja também atan(), asinh() e acosh().

source: Returns the arc tangent of arg in radians. atan() is the complementary function of tan(), which means that a==tan(atan(a)) for every value of a that is within atan() 's range.
pt_br: Retorna o inverso da tangente de arg em radianos. atan() é a função complementar de tan(), o que significa que var == tan(atan(var)) para qualquer valor de a que esteja dentro dos limites de atan().

source: See also atanh(), asin() and acos().
pt_br: Veja também atanh(), asin() e acos().

source: base64_decode() decodes encoded_data and returns the original data.
pt_br: base64_decode() decodes encoded_data e retorna o dado original.

source: The returned data may be binary.
pt_br: O retorno pode ser binário.

source: See also: base64_encode(), RFC 2045 section 6.8.
pt_br: Veja também: base64_encode(), RFC-2045 seção 6.8.

source: URL Functions
pt_br: Funções URL

source: base64_encode() returns data encoded with base64.
pt_br: Descrição

source: This encoding is designed to make binary data survive transport through transport layers that are not 8-bit clean, such as mail bodies.
pt_br: Esta codificação é designada para que dados binários durem no transporte sobre camadas de transorte que não são 8-bit clean, como mensagens de e-mail.

source: Base64-encoded data takes about 33% more space than the original data.
pt_br: Dados codificados na Base-64 tem aproximadamente 33% mais espaço que dos dados originais.

source: See also: base64_decode(), chunk_split(), RFC 2045 section 6.8.
pt_br: Veja também: base64_decode(), chunk_split(), RFC-2045 seção 6.8.

source: (PHP 3 = 3.0.6, PHP 4)
pt_br: base_convert

source: Returns a string containing number represented in base tobase.
pt_br: Descrição

source: The base in which number is given is specified in frombase.
pt_br: Retorna uma string contendo number representado na base tobase.

source: Both frombase and tobase have to be between 2 and 36, inclusive.
pt_br: Tanto frombase quanto tobase tem que estar entre 2 e 36, inclusive.

source: Digits in numbers with a base higher than 10 will be represented with the letters a-z, with a meaning 10, b meaning 11 and z meaning 35.
pt_br: Digitos em números com base maior do que 10 serão representados com letras a-z, com a significando 10, b significando 11 e z significando 35.

source: Example 1. base_convert()
pt_br: Exemplo 1. base_convert()

source: Given a string containing a path to a file, this function will return the base name of the file.
pt_br: Dado uma string contendo um caminho para um arquivo, essa função irá retornar o nome base do arquivo.

source: If the filename ends in suffix this will also be cut off.
pt_br: Se o nome do arquivo termina com o sufixo, este também será retirado.

source: On Windows, both slash (/) and backslash (\) are used as path separator character.
pt_br: No Windows, tanto a barra (/) quanto a barra invertida (\) são usadas como caracter de separacao do caminho.

source: In other environments, it is the forward slash (/).
pt_br: Em outros ambientes, somente a barra (/).

source: Example 1. basename() example
pt_br: Exemplo 1. exemplo do basename()

source: $path = "/ home / httpd / html / index.php"; $file = basename ($path); / / $file is set to "index.php" $file = basename ($path ,".php"); / / $file is set to "index "
pt_br: $caminho = "/ home / httpd / html / index.php"; $arquivo = basename ($caminho); / / $arquivo = "index.php" $arquivo = basename ($caminho ,".php"); / / $arquivo = "index "

source: The suffix parameter was added in PHP 4.1.0.
pt_br: O parametro sufixo foi adicionado no PHP 4.1.0.

source: See also: dirname()
pt_br: Veja também: dirname()

source: Filesystem functions
pt_br: Filesystem (Sistema de arquivos)

source: Adds the left_operand to the right_operand and returns the sum in a string.
pt_br: Adiciona o operador_da_esquerda ao operador_da_direita e retorna a soma em uma string.

source: The optional scale parameter is used to set the number of digits after the decimal place in the result.
pt_br: O parametro opcional escala é usado para configurar o número de digitos depois do ponto decimal a ser usados no resultado.

source: See also bcsub().
pt_br: Veja também bcsub().

source: Compares the left_operand to the right_operand and returns the result as an integer.
pt_br: Compara o operador_da_esquerda com o operador_da_direita e retorna o resultado como um inteiro.

source: The optional scale The optional scale parameter is used to set the number of digits after the decimal place which will be used in the comparison.
pt_br: O parametro opcional escala é usado para configurar o número de digitos depois do ponto decimal que serão utilizados na comparação.

source: The return value is 0 if the two operands are equal.
pt_br: O valor retornado será 0 se os operadores são iguais.

source: If the left_operand is larger than the right_operand the return value is +1 and if the left_operand is less than the right_operand the return value is -1.
pt_br: Se o operador_da_esquerda for maior do que o operador_da_direita o valor a ser retornado será +1 e se o operador_da_esquerda é menor do que o operador_da_direita o valor retornado é -1.

source: Divides the left_operand by the right_operand and returns the result.
pt_br: Divide o operador_da_esquerda pelo operador_da_direita e retorna o resultado.

source: The optional scale sets the number of digits after the decimal place in the result.
pt_br: O parametro opcional escala é usado para configurar o número de dígitos depois do ponto decimal que serão mostrados no resultado.

source: See also bcmul().
pt_br: Veja também bcmul().

source: Get the modulus of the left_operand using modulus.
pt_br: Obter o módulo do operador_da_esquerda usando modulo.

source: See also bcdiv().
pt_br: Veja também bcdiv().

source: Multiply the left_operand by the right_operand and returns the result.
pt_br: Multipica o operador_da_esquerda pelo operador_da_direita e retorna o resultado.

source: Raise x to the power y.
pt_br: Description

source: The optional scale can be used to set the number of digits after the decimal place in the result.
pt_br: O parametro opcional escala configura o número de dígitos depois do ponto decimal que serão mostrados no resultado.

source: See also bcpowmod(), and bcsqrt().
pt_br: Veja também bcsqrt().

source: This function sets the default scale parameter for all subsequent bc math functions that do not explicitly specify a scale parameter.
pt_br: Este valor será utilizado caso o parametro escala não seja especificado em chamadas as bcmath subsequentes.

source: Return the square root of the operand.
pt_br: Descrição

source: The optional scale parameter sets the number of digits after the decimal place in the result.
pt_br: O parametro opcional escala configura o número de digitos depois do ponto decimal que serão mostrados no resultado.

source: Subtracts the right_operand from the left_operand and returns the result in a string.
pt_br: Subtrair o operador_da_direita do operador_da_esquerda e retorna o resultado em uma string.

source: See also bcadd().
pt_br: Veja também bcadd().

source: Bzip2 Compression Functions
pt_br: Funções de compactação com Bzip2

source: Returns an ASCII string containing the hexadecimal representation of str.
pt_br: Retorna uma string ASCII uma representação hexadecimal de str.

source: The conversion is done byte-wise with the high-nibble first.
pt_br: A conversão é feita byte-wise com o high-nibble primeiro.

source: See also pack() and unpack().
pt_br: Veja também pack() e unpack().

source: Returns the decimal equivalent of the binary number represented by the binary_string argument.
pt_br: Retorna o equivalente decimal do número binário representado pelo argumento binary_string.

source: bindec() converts a binary number to an integer.
pt_br: bindec() converte um número binário em um integer.

source: The largest number that can be converted is 31 bits of 1 's or 2147483647 in decimal.
pt_br: O maior número que pode ser convertido é 31 bits de ums (1) ou 2147483647 em decimal.

source: See also: decbin().
pt_br: Veja também a função decbin().

source: Closes the bzip2 file referenced by the pointer bz.
pt_br: Fecha o arquivo bzip2 referenciado pelo ponteiro bz.

source: The file pointer must be valid, and must point to a file successfully opened by bzopen().
pt_br: O ponteiro de arquivo deve ser válido, e deve apontar para um arquivo aberto com sucesso com bzopen().

source: See also bzopen().
pt_br: Veja também bzopen().

source: bzcompress() compresses the source string and returns it as bzip2 encoded data.
pt_br: bzcompress() comprime a string source e a retorna no formato de dados codificados com bzip2.

source: The optional parameter blocksize specifies the blocksize used during compression and should be a number from 1 to 9 with 9 giving the best compression, but using more resources to do so. blocksize defaults to 4.
pt_br: O valor padrão de blocksize é 4.

source: The optional parameter workfactor controls how the compression phase behaves when presented with worst case, highly repetitive, input data.
pt_br: O parâmetro opcional workfactor controla como a fase de compressão irá se comportar quando ocorrer o pior caso: a entrada de dados muito repetitivos.

source: The value can be between 0 and 250 with 0 being a special case and 30 being the default value.
pt_br: O seu valor pode ser de 0 até 250, com 0 sendo um caso especial, e 30 o valor padrão.

source: Regardless of the workfactor, the generated output is the same.
pt_br: Independente do valor de workfactor, a saída gerada será a mesma.

source: Example 1. bzcompress() Example
pt_br: Exemplo de bzcompress()

source: ?php $str = "sample data"; $bzstr = bzcompress($str, 9); print ($bzstr);?
pt_br: ?php $str = "demonstracao de dados comprimidos"; $bzstr = bzcompress($str, 9); print($bzstr);?

source: See also bzdecompress().
pt_br: Veja também bzdecompress().

source: bzdecompress() decompresses the source string containing bzip2 encoded data and returns it.
pt_br: bzdecompress() descomprime a string source string contendo dados no formato bzip2 e retorna o seu valor.

source: If the optional parameter small is TRUE, an alternative decompression algorithm will be used which uses less memory (the maximum memory requirement drops to around 2300K) but works at roughly half the speed.
pt_br: Se o parâmetro opcional small for TRUE, um algoritmo alternativo de descompressão, com a utilização de menos memória (a máxima quantidade de memória requerida é em torno de 2300K), será usado mas funciona com a metade da velocidade.

source: See the bzip2 documentation for more information about this feature.
pt_br: Veja a documentação do bzip2 para mais informações sobre essa característica.

source: Example 1. bzdecompress()
pt_br: Exemplo 1. bzdecompress()

source: ?php $start_str = "This is not an honest face ?"; $bzstr = bzcompress($start_str); print ("Compressed String:"); print ($bzstr); print ("\n br \n "); $str = bzdecompress($bzstr); print ("Decompressed String:"); print ($str); print ("\n br \n ");?
pt_br: ?php $start_str = "Esse cara é legal ?"; $bzstr = bzcompress($start_str); print ("String comprimida:"); print ($bzstr); print ("\n br \n "); $str = bzdecompress($bzstr); print ("String descomprimida:"); print ($str); print ("\n br \n ");?

source: See also bzcompress().
pt_br: Veja também bzcompress().

source: Returns the error number of any bzip2 error returned by the file pointer bz.
pt_br: Retorna o número do erro de qualquer erro do bzip2 retornado pelo ponteiro de arquivo bz.

source: See also bzerror() and bzerrstr().
pt_br: Veja também bzerror() e bzerrstr().

source: Returns the error number and error string, in an associative array, of any bzip2 error returned by the file pointer bz.
pt_br: Retorna o número e string do erro, em um array associativo, de qualquer erro retornado pelo ponteiro de arquivo bz.

source: Example 1. bzerror() Example
pt_br: Exemplo de bzerror()

source: See also bzerrno() and bzerrstr().
pt_br: Veja também bzerrno() e bzerrstr().

source: Returns the error string of any bzip2 error returned by the file pointer bz.
pt_br: Retorna a string de erro de qualquer erro retornado pelo ponteiro de arquivo bz.

source: See also bzerrno() and bzerror().
pt_br: Veja também bzerrno() e bzerror().

source: Forces a write of all buffered bzip2 data for the file pointer bz.
pt_br: Força a escrita de todos os dados do bzip2 que estão em buffer para o ponteiro de arquivo bz.

source: See also bzread() and bzwrite().
pt_br: Veja também bzread() e bzwrite().

source: Opens a bzip2 (.bz2) file for reading or writing. filename is the name of the file to open. mode is similar to the fopen() function (`r 'for read, `w' for write, etc.).
pt_br: O parâmetro filename é o nome do arquivo a ser aberto. mode é similar ao da função fopen() (`r 'para leitura, `w' para escrita, etc.).

source: If the open fails, the function returns FALSE, otherwise it returns a pointer to the newly opened file.
pt_br: Se esta função falhar, retorna FALSE, do contrário retorna um ponteiro de arquivo aberto.

source: Example 1. bzopen() Example
pt_br: Exemplo de bzopen()

source: ?php $bz = bzopen( "/ tmp / foo.bz2", "r"); $decompressed_file = bzread($bz, filesize(" / tmp / foo.bz2")); bzclose($bz); print ("The contents of / tmp / foo.bz2 are:"); print ("\n br \n "); print ($decompressed_file);?
pt_br: ?php $bz = bzopen( "/ tmp / foo.bz2", "r"); $arquivo_descomprimido = bzread($bz, filesize(" / tmp / foo.bz2")); bzclose($bz); print ("O conteúdo de / tmp / foo.bz2 é:"); print ("\n br \n "); print ($arquivo_descomprimido);?

source: See also bzclose().
pt_br: Veja também bzclose().

source: bzread() reads up to length bytes from the bzip2 file pointer referenced by bz.
pt_br: bzread() lê o número de bytes equivalente a length do ponteiro de arquivo bzip2 referenciado por bz.

source: Reading stops when length Reading stops when length (uncompressed) bytes have been read or EOF is reached, whichever comes first.
pt_br: A leitura pára quando a a quantidade de bytes referenciados por length (descomprimidos) foram lidos ou EOF foi alcançado, o que acontecer primeiro.

source: If the optional parameter length is not specified, bzread() will read 1024 (uncompressed) bytes at a time.
pt_br: Se o parâmetro opcional length não for especificado, bzread() irá ler 1024 bytes (descomprimidos) de cada vez.

source: Example 1. bzread() Example
pt_br: Exemplo de bzread()

source: See also bzwrite() and bzopen().
pt_br: Veja também bzwrite() e bzopen().

source: bzwrite() writes the contents of the string data to the bzip2 file stream pointed to by bz.
pt_br: bzwrite() escreve o conteúdo da string data no arquivo referenciado pelo ponteiro de arquivo bzip2 bz.

source: If the optional length argument is given, writing will stop after length (uncompressed) bytes have been written or the end of string is reached, whichever comes first.
pt_br: Se o parâmetro opcional length for passado, a escrita irá parar depois deste número de bytes (descomprimidos) foram escritos ou se o final da string foi alcançado, o que acontecer primeiro.

source: Example 1. bzwrite() Example
pt_br: Exemplo de bzwrite()

source: ?php $str = "uncompressed data"; $bz = bzopen(" / tmp / foo.bz2", "w"); bzwrite($bz, $str, strlen($str)); bzclose($bz);?
pt_br: ?php $str = "dados descomprimidos"; $bz = bzopen(" / tmp / foo.bz2", "w"); bzwrite($bz, $str, strlen($str)); bzclose($bz);?

source: See also bzread() and bzopen().
pt_br: Veja também bzread() e bzopen().

source: function barber ($type) {print "You wanted a $type haircut, no problem";} call_user_func ('barber', "mushroom"); call_user_func ('barber', "shave");
pt_br: Object methods may also be invoked statically using this function by passing array( $objectname, $methodname) to the function parameter.

source: See also: call_user_func_array(), call_user_method(), call_user_method_array().
pt_br: ?php class myclass {function say_hello() {print "Hello!\n";}} $classname = "myclass"; call_user_func(array($classname ,'say_hello'));?

source: The call_user_method_array() function is deprecated as of PHP 4.1.0, use the call_user_func_array() variety with the array ($obj, "method_name") syntax instead.
pt_br: Utilize a variante call_user_func_array() com a sintaxe array ($obj, "method_name").

source: Calls the method referred by method_name from the user defined obj object, using the parameters in paramarr.
pt_br: Chama o método method_name do objeto de usuáro obj, usando os parâmetros em paramarr.

source: See also: call_user_func_array(), call_user_func(), call_user_method().
pt_br: Veja também call_user_func_array(), call_user_func() e call_user_method().

source: This function was added to the CVS code after release of PHP 4.0.4pl1
pt_br: Esta função foi adicionada no código CVS antes da liberaçao do PHP 4.0.4pl1

source: Class / Object Functions
pt_br: Classes e Objetos

source: The call_user_method() function is deprecated as of PHP 4.1.0, use the call_user_func() variety with the array ($obj, "method_name") syntax instead.
pt_br: A função call_user_method() é obsoleta desde o PHP 4.1.0, portanto utilize a variante call_user_func() com a sintaxe array ($obj, "method_name").

source: Calls the method referred by method_name from the user defined obj object.
pt_br: Chama o método method_name do objeto de usuário obj.

source: An example of usage is below, where we define a class, instantiate an object and use call_user_method() to call indirectly its print_info method.
pt_br: Um exemplo de seu uso segue abaixo, onde nós definimos uma classe, instanciamos um objeto e usamos call_user_method() para chamar indiretamente seu método print_info.

source: ?php class Country {var $NAME; var $TLD; function Country($name, $tld) {$this - NAME = $name; $this - TLD = $tld;} function print_info($prestr="") {echo $prestr ."Country: ".$this - NAME ."\n"; echo $prestr ."Top Level Domain: ".$this - TLD ."\n";}} $cntry = new Country("Peru" ,"pe"); echo "* Calling the object method directly\n"; $cntry - print_info(); echo "\n* Calling the same method indirectly\n"; call_user_method ("print_info", $cntry, "\t");?
pt_br: ?php class Country {var $NAME; var $TLD; function Country($name, $tld) {$this - NAME = $name; $this - TLD = $tld;} function print_info($prestr="") {echo $prestr ."Country: ".$this - NAME ."\n"; echo $prestr ."Top Level Domain: ".$this - TLD ."\n";}} $cntry = new Country("Peru" ,"pe"); echo "* Chamando o método diretamente\n"; $cntry - print_info(); echo "\n* Chamando o método indiretamente\n"; call_user_method ("print_info", $cntry, "\t");?

source: See also call_user_func_array(), call_user_func(), and call_user_method_array().
pt_br: Veja também call_user_func_array(), call_user_func() e call_user_method_array().

source: Returns the next highest integer value by rounding up value if necessary.
pt_br: Retorna o próximo maior valor inteiro arredondando para cima do valor, se fracionário.

source: The return value of ceil() is still of type float as the value range of float is usually bigger than that of integer.
pt_br: O valor retornado de ceil() é do tipo float porque a dimensão dos valores suportados por float é normalmente maior do que o do tipo int.

source: Example 1. ceil() example
pt_br: Exemplo 1. exemplos ceil()

source: See also floor() and round().
pt_br: Veja também floor() e round().

source: Changes PHP 's current directory to directory.
pt_br: Muda o diretório atual do PHP para diretorio.

source: Returns TRUE on success or FALSE on failure..
pt_br: Retorna FALSE se não for possível mudar de diretório ou TRUE em sucesso.

source: See also getcwd().
pt_br: Veja também: getcwd().

source: Directory functions
pt_br: Diretórios

source: Returns TRUE if the date given is valid; otherwise returns FALSE.
pt_br: Descrição

source: Checks the validity of the date formed by the arguments.
pt_br: Retorna TRUE se a data dada é válida; caso contrário retorna FALSE.

source: A date is considered valid if:
pt_br: Checa a validade da data formada pelos argumentos.

source: year is between 1 and 32767 inclusive
pt_br: Uma data é considerada válida se:

source: month is between 1 and 12 inclusive
pt_br: o year está entre 1 e 32767

source: Leap year s are taken into consideration.
pt_br: Day deve está dentro do número de dias permitidos para o dado month. year s são levados em consideração.

source: See also mktime() and strtotime().
pt_br: Veja também mktime() e strtotime().

source: Date and Time functions
pt_br: Funções data e hora

source: Attempts to change the group of the file filename to group (specified by name or number).
pt_br: Tenta modificar o grupo do arquivo para o grupo (nome ou número).
